# "1st program"
print(9 ** 0.5 * 5)
# "2nd program".
print(9.99 > 9.98 and 1000 != 1000.1)
#
# "3rd program".
#
print(2 * 2 +2)
print(2 * (2 + 2))
print((2 * 2 +2) == (2 * (2 + 2)))
#
print("4th program")
# Дана строка '123.456'.
# Вывести на экран первую цифру после запятой - 4.
#print(123.456)
#ам необходимо строку преобразовать в число с точкой float(),
# умножить на 10,
# получившийся результат преобразовать в целочисленный тип int(),
# сделать остаток от деления % 10.
a = float ('123.456')
print (type (a))
a1 = int (123.456 * 10)
print (a1)
print (a1 % 10)
#a2 = ((str (int (a1))))
#print(a2 [-1])
print('123.456')
a = float ('123.456')
a1 = int (a * 10)
print (a1 % 10)
#a2 = ((str (int (a1))))
#print(a2 [-1])
